In [1]:
from database_app import query_table

#### Query sample records

In [2]:
sample_df = query_table(
    """
    select date_time, lower(word), word_count from twitter_words limit 3
    """
)

2.6.0

In [3]:
sample_df.head(3)

             date_time lower(word)  word_count
0  2020-07-04 19:33:14         but           1
1  2020-07-04 19:33:14        they           1
2  2020-07-04 19:33:14    sundays?           1

#### Duration of stored twitter data

In [4]:
query_table(
    """
    select min(date_time) as start, max(date_time) as end, count(*) as records from twitter_words
    """
)

2.6.0

                 start                  end  records
0  2020-07-04 19:33:14  2020-07-04 23:25:39    16229

#### Query top 5 words (ignore stop words)

In [5]:
stopwords = [
    'the', 'to', 'i', 'a', 'on', 'is', 'in', 'you', 'of', 'it', 'and', 'this', 'was', 'he', 'had', 'our', 'from', 'what',
    'for', 'that', 'be', 'my', 'so', 'they', 'all', 'have', 'me', 'his', 'with', 'when', 'we', 'but', 'not', 'are', 'at',
    'no', 'now', 'your', 'there', 'just', 'can', 'will', 'like', 'if', 'am', 'it’s', 'i’m'
]

stopwords.sort()

In [9]:
query_table(
    """
    select
        lower(word),
        sum(word_count)
    from twitter_words
    where lower(word) not in ({}) and trim(word) != '' and trim(word) not in ('@')
    group by lower(word)
    order by sum(word_count) desc
    limit 5
    """.format(str(stopwords)[1:-1])
)

2.6.0

  lower(word)  sum(word_count)
0       happy              116
1         4th              115
2         new               82
3        july               73
4       today               69

#### Query top 5 tagged individuals

In [10]:
query_table(
    """
    select word as tagged, sum(word_count) as tagged_freq
    from twitter_words
    where word like '@%' and word != '@'
    group by word
    order by tagged_freq desc
    limit 5
    """
)

2.6.0

             tagged  tagged_freq
0  @realDonaldTrump           20
1   @ProjectLincoln            8
2        @robreiner            5
3     @peekaboo_jen            4
4  @VforVintageVera            4

#### Query top 5 hashtag

In [11]:
query_table(
    """
    select word as hashtag, sum(word_count) as hashtag_freq
    from twitter_words
    where word like '#%'
    group by word
    order by hashtag_freq desc
    limit 5
    """
)

2.6.0

               hashtag  hashtag_freq
0       #4thofJuly2020            11
1  #AllCountriesMatter             8
2           #4thofJuly             7
3           #4thofjuly             5
4             #NewYork             4